3spds/stm32f4/Creosota_Tour_2015/src/main_filt_dsp.c
#include <../inc/stm32f4xx.h>
#include <../inc/stm32f4xx_gpio.h>
#include <../inc/stm32f4xx_rcc.h>
#include <../inc/stm32f4xx_adc.h>
#include <../inc/stm32f4xx_dac.h>
#include <../inc/stm32f4xx_dma.h>
#include <../inc/stm32f4xx_tim.h>
#include <../inc/arm_math.h>
#include <../inc/stm32f4_discovery.h>
#include <../inc/stm32f4xx_conf.h>
#include <stdio.h>
#include <stdlib.h>
#include <math.h>

#define ADC3_DR_ADDRESS     ((uint32_t)0x4001224C)
#define ADC1_DR_ADDRESS     ((uint32_t)0x4001204C)
#define DAC_DHR12R2_ADDRESS 0x40007414
#define VECSIZE 4
#define DELSIZE 6000
#define nfilters 800
#define RATE 65536
#define gsize 18

uint16_t ADC3ConvertedValue[4] = {0, 0, 0, 0};
uint16_t DAC1ConvertedValue[VECSIZE];
uint16_t DAC2ConvertedValue[VECSIZE];
long i = 0;
long counter = 0;
float32_t outvalue = 0;
float32_t fbvalue = 0;
float32_t fb = 0;
float32_t gate = 0.999999;
float32_t modrate = 1.0;
int gcounter = 0;
uint16_t outints[VECSIZE];
uint16_t pre_filter = 0;
float ADC3ConvertedVoltage[4];
float32_t vector_a[VECSIZE];
float32_t vector_b[VECSIZE];
float32_t vector_c[VECSIZE];
float32_t vector_d[DELSIZE];
uint16_t sig[VECSIZE];
float32_t coefTable[nfilters * 5];
float32_t gamut[gsize] = {1, 1.0667, 1.2, 1.25, 1.422, 1.5, 1.667, 1.8, 2, 2.1340, 2.2770, 2.5608, 2.6675, 3.0345, 3.5574, 3.8412, 4, 4.2680};
uint16_t gindex = 0;
uint16_t g2index = 0;
float32_t coef_single[5] = {0.707927287, -1.60492671, 1, 1.60492671, -0.707927287};
float32_t coef_single_prev[5] = {0.707927287, -1.60492671, 1, 1.60492671, -0.707927287};
float32_t biquadState[2*nfilters];

uint32_t nconversions = 4;
int j = 0;
int k = 0;
//float sinusoid = 0;
GPIO_InitTypeDef      GPIO_InitStruct;
ADC_InitTypeDef       ADC_InitStructure;
ADC_CommonInitTypeDef ADC_CommonInitStructure;
DMA_InitTypeDef       DMA_InitStructure;
DAC_InitTypeDef       DAC_InitStructure;
arm_biquad_cascade_df2T_instance_f32 S1;

typedef struct filter {
	float32_t DOUTBUF[VECSIZE];		/* Delayed filter output feedback */
	float32_t DINBUF[VECSIZE];		/* Delayed filter input */
	float32_t f_b0, f_b1, f_b2;	/* filter cooefficients*/
	float32_t f_a0, f_a1, f_a2, f_inv_a0;
	float32_t f_f0, f_w0;		/* center frequency for the filter */
	float32_t f_ff1, f_ff2, f_ff3; /* feed-forward coeffs */
	float32_t f_fb1, f_fb2; /* feed-back coeffs */
	float32_t f_inv_srate;	/* inverse sample rate */
	float32_t f_alpha, f_rq;
} filter;

typedef struct fsr {
	uint16_t mod;
	uint16_t add;
	uint16_t mul;
	uint16_t out;
} fsr;

typedef struct phasor {
    float32_t prev_add;
    float32_t slew;
	float32_t add;
	float32_t mul;
	float32_t out;
} phasor;

//filter ap_1;
//filter ap_2;
//filter ap_3;
//filter ap_4;

filter ap;
fsr noise;
fsr noise2;
fsr noise3;
phasor saw;
phasor melody;
phasor harmony;
phasor drone;
phasor dronelo;

void Delay(uint32_t nCount);
void init_TIM2(void);
void TIM2_IRQHandler(void);
void init_TIM3(void);
void TIM3_IRQHandler(void);
void init_TIM4(void);
void TIM4_IRQHandler(void);
void init_TIM6(void);
void TIM6_DAC_IRQHandler(void);
void init_GPIOA(void);
void init_GPIOC(void);
void init_GPIOD(void);
void init_ADC3(void);
void init_DMA1(void);
void init_DMA2(void);
void init_DAC(void);
void ap_filter_coefs(filter *x);
float32_t apply_filter(float32_t input, int i, filter *x);
void init_filter(filter *x);
float32_t run_fsr(fsr *x);
float32_t run_phasor(phasor *);

void Delay(__IO uint32_t nCount)
{
    while(nCount--)
    {
    }
}
//timer 2
void init_TIM2(void)
{
	//do it by registers!
	NVIC->ISER[0] |= 1<<(TIM2_IRQn); //Interrupt set-enable register, enable TIM2 IRQ
	RCC->APB1ENR |= RCC_APB1ENR_TIM2EN; // enable TIM2 clock
	TIM2->PSC = 0xFFFF; //prescaler
	TIM2->DIER |= TIM_DIER_UIE; //dma / interrupt enable register -> update interrupt enable
	TIM2->ARR = 0xFFFF; //auto reload register
	TIM2->CR1 |= TIM_CR1_ARPE | TIM_CR1_CEN; //auto reload preload and counter enable
	TIM2->EGR = 1; //tells TIM2 there's been an update
}
void TIM2_IRQHandler(void) //blinker
{
	//if status register & update interrupt flag are both enabled,
	if (TIM2->SR & TIM_SR_UIF)
	{
		GPIOD->ODR ^= (1 << 13);	//toggle D13
		run_fsr(&noise2);
		g2index = noise2.out;
		noise.add = g2index;
		noise3.add = g2index + 4 % gsize;
//		noise.add = (uint16_t)(ADC3ConvertedVoltage[2]*gsize);
	}
	TIM2->SR = 0x0; //reset TIM2's status register
}
//timer 3
void init_TIM3(void)
{
	//do it by registers!!
	NVIC->ISER[0] |= 1<<(TIM3_IRQn); //Interrupt set-enable register, enable TIM3 IRQ
	RCC->APB1ENR |= RCC_APB1ENR_TIM3EN; // enable TIM3 clock
	TIM3->PSC = 0x10; //prescaler - count with peripheral clock
	TIM3->DIER |= TIM_DIER_UIE; //dma / interrupt enable register -> update interrupt enable
	TIM3->ARR = 0xC000; //auto reload register
	TIM3->CR1 |= TIM_CR1_ARPE | TIM_CR1_CEN; //auto reload enable and counter enable
	TIM3->EGR = 1; //tells TIM3 there's been an update
}
void TIM3_IRQHandler(void) //adc float converter
{
	//if status register & update interrupt flag are both enabled,
	if (TIM3->SR & TIM_SR_UIF)
	{
//		GPIOD->ODR ^= (1 << 15);	//toggle D15
		for(j = 0; j<nconversions; j++)
		{ //convert adc inputs to float
			ADC3ConvertedVoltage[j] = ((float)(ADC3ConvertedValue[j])/4096);
		}

//		(ap.f_w0) = ADC3ConvertedVoltage[1];
        modrate = ((1-(float32_t)ADC3ConvertedVoltage[0])*10)+5;
//        modrate = 10.1;
        ADC3ConvertedVoltage[1] += 0.3;
        ADC3ConvertedVoltage[1] *= ADC3ConvertedVoltage[1];
        //(ap.f_w0) = (0.3*ADC3ConvertedVoltage[1]*sin((float32_t)i/modrate*2*3.14159)/2) + (ADC3ConvertedVoltage[1]*0.5);
        (ap.f_w0) = (ADC3ConvertedVoltage[1]);
		(ap.f_rq) = (0.7*ADC3ConvertedVoltage[2]) + 0.06;

		ap_filter_coefs(&ap);

		coef_single[0] = (0.8*ap.f_ff1)+(0.2*coef_single_prev[0]);
		coef_single[1] = (0.8*ap.f_ff2)+(0.2*coef_single_prev[1]);
		coef_single[2] = (0.8*ap.f_ff3)+(0.2*coef_single_prev[2]);
		coef_single[3] = (0.8*ap.f_fb1)+(0.2*coef_single_prev[3]);
		coef_single[4] = (0.8*ap.f_fb2)+(0.2*coef_single_prev[4]);

		for(j=0; j<5; j++)
		{
//			coef_single[j] = 0.5*(ap.f_ff1 + coef_single_prev[j]);
			coef_single_prev[j] = coef_single[j];
		}

		for(j = 0; j<(nfilters*5); j++) //repeat coefs nfilters times
		{
			coefTable[j] = coef_single[(j%5)];
		}
//        noise.add = (uint16_t)ADC3ConvertedVoltage[1]*60000;
//        noise.mul = (uint16_t)ADC3ConvertedVoltage[2]*60000;
//        noise.mod = (uint16_t)ADC3ConvertedVoltage[3]*60000;
//		noise.add = (uint16_t)(sin(((float32_t)i)/10000000)*30000 + 30000);
//		noise.mul = (uint16_t)(sin(((float32_t)i)/10040500)*30000 + 30000);
//		noise.mod = (uint16_t)(sin(((float32_t)i)/10500300)*30000 + 30000);

