3spds/stm32f4/Creosota_Tour_2015/src/main_filt_dsp.c
//		ap_filter_coefs(&ap_2);
//		ap_filter_coefs(&ap_3);
//		for(k=0;k<nfilters;k++)
//		{
//			filters[k].f_rq = (float32_t)ADC3ConvertedValue[1]/4096;
//			filters[k].f_w0 = (float32_t)ADC3ConvertedValue[0]/4096;
//			ap_filter_coefs(&filters[k]);
			//fb = (float32_t)ADC3ConvertedValue[2]/4096;
//		}


	}
	TIM3->SR = 0x0; //reset TIM3's status register
}
//timer 4
void init_TIM4(void)
{
	//do it by registers!
	NVIC->ISER[0] |= 1<<(TIM4_IRQn); //Interrupt set-enable register, enable TIM4 IRQ
	RCC->APB1ENR |= RCC_APB1ENR_TIM4EN; // enable TIM4 clock
	TIM4->PSC = 0xFF; //prescaler - count with peripheral clock
	TIM4->DIER |= TIM_DIER_UIE; //dma / interrupt enable register -> update interrupt enable
	TIM4->ARR = 0xFFFF; //auto reload register
	TIM4->CR1 |= TIM_CR1_ARPE | TIM_CR1_CEN; //auto reload enable and counter enable
	TIM4->EGR = 1; //tells TIM4 there's been an update
}
void TIM4_IRQHandler(void) //output processor
{
	//if status register & update interrupt flag are both enabled,
	if (TIM4->SR & TIM_SR_UIF){
		GPIOD->ODR ^= (1 << 15);	//toggle D15
        run_fsr(&noise);
        run_fsr(&noise3);
	}
	TIM4->SR = 0x0; //reset TIM4's status register
}
//timer 6
void init_TIM6(void)
{
	//do it mostly by registers!
	NVIC_EnableIRQ(TIM6_DAC_IRQn);
//	NVIC->ISER[1] |= (uint32_t)(1 << ((uint32_t)((int32_t)TIM6_DAC_IRQn) & (uint32_t)0x1F)); /* enable interrupt */
	RCC->APB1ENR |= RCC_APB1ENR_TIM6EN; //enable tim6 rcc
	TIM6->ARR = 0x02; //auto reload register
    TIM6->PSC = 0x100; //prescaler
    TIM6->DIER |= TIM_DIER_UIE; // update interrupt enable
    TIM6->CR1 |= TIM_CR1_ARPE | TIM_CR1_CEN; //auto reload preload and counter enable
	TIM6->CR2 &= (uint16_t)~TIM_CR2_MMS; //reset mms
	TIM6->CR2 |=  TIM_TRGOSource_Update; //select trgo source
    TIM6->EGR = 1; //update
}
void TIM6_DAC_IRQHandler(void)
{
	int l = 0;
	//if sr & uif are both enabled
	if(TIM6->SR & TIM_SR_UIF)
	{
		GPIOD->ODR ^= (1<<14); //toggle D14
//		vector_a[i] = ADC3ConvertedValue[0];
//      vector_b[i] = ADC3ConvertedValue[1];
//      vector_c[i] = ADC3ConvertedValue[2];
//      vector_d[i] = ADC3ConvertedValue[3];
//		outvalue+=ADC3ConvertedValue[0]; //pseudorandom number generation
//		outint+=ADC3ConvertedValue[0];
//		outint%=ADC3ConvertedValue[1];
//		outint+=ADC3ConvertedValue[2];
//		pre_filter = (outvalue%=4096);
//		outint%=4096;
//		outvalue+=sig[i];
//		outint>>=1;

//		outvalue = (uint32_t)(outvalue*0.5) + (uint32_t)(sig[(VECSIZE+i)%VECSIZE]*0.5);
//		outvalue = apply_filter(outvalue, &ap_1);
//		outvalue = apply_filter(outvalue, &ap_2);
//		outvalue = apply_filter(outvalue, &ap_3);
//		outvalue = apply_filter(outvalue, &ap_4);
		//outvalue = gate * run_fsr(&noise);
//		outvalue = gate;
		for(l = 0; l<VECSIZE; l++) //generate noise vector
		{
//			vector_a[l] = 0.2*(run_fsr(&noise));
//			vector_a[l] = rand() / (RAND_MAX/2) - 1;
//			vector_a[l] *= 0.1;
//			vector_a[l] = 0.2*sin(((float32_t)i/100.0)*3.14159*2);
//			if(!(i%RATE)) vector_a[l] = 1;
//			else vector_a[l] = 0;

			melody.add = gamut[noise.out] / 200;
			melody.slew = 0.999 + (0.001 * (1-ADC3ConvertedVoltage[1]));
			harmony.add = gamut[noise3.out] / 400;
			harmony.slew = 0.999 + (0.001 * (1-ADC3ConvertedVoltage[1]));
			saw.add = gamut[noise.out + 2 % gsize] / 800;
			saw.slew = 0.999 + (0.001 * (1-ADC3ConvertedVoltage[1]));
			drone.add = gamut[noise2.out] / 25;
			dronelo.add = gamut[noise2.out + 7 % gsize] / 800;
			vector_a[l] = (0.3*run_phasor(&saw))*((1-(ADC3ConvertedVoltage[0]*0.1)));
			vector_a[l] += (0.3*run_phasor(&melody))*((1-(ADC3ConvertedVoltage[0]*0.1)));
			vector_a[l] += (0.2*run_phasor(&harmony))*((1-(ADC3ConvertedVoltage[0]*0.1)));
			vector_a[l] += (0.1*run_phasor(&drone))*((1-(ADC3ConvertedVoltage[0]*0.1)));
			vector_a[l] += (0.2*run_phasor(&dronelo))*((1-(ADC3ConvertedVoltage[0]*0.1)));
			vector_a[l] *= ((float32_t)(ADC3ConvertedValue[3])/4096);
//			vector_a[l] = (ADC3ConvertedValue[3]);

//			vector_a[l] *= (run_fsr(&noise));
//			vector_a[l] *= rand() / (RAND_MAX/2) - 1;
//			vector_c[l] = vector_a[l];
//			if(ADC3ConvertedValue[3] > 2048) GPIOD->ODR ^= (1<<12);
//			vector_a[l] += ((ADC3ConvertedVoltage[0])+0.1*vector_b[l]*sin(((float32_t)i/100.0)*3.14159*2));
			vector_a[l] += (((ADC3ConvertedVoltage[0])+0.5)*vector_d[i%DELSIZE]);
			vector_a[l] += (((ADC3ConvertedVoltage[0])+0.25)*vector_d[(i+(uint32_t)(DELSIZE*0.5))%DELSIZE]);
			vector_a[l] += (((ADC3ConvertedVoltage[0])+0.5)*vector_d[(i+(uint32_t)(DELSIZE*0.8))%DELSIZE]);
			vector_a[l] += (((1-ADC3ConvertedVoltage[0])+0.5)*vector_d[(i+(uint32_t)(DELSIZE*0.3))%DELSIZE]);
			vector_a[l] *= 0.6;
            if(vector_a[l]>1.5574) vector_a[l] = 1.5574;
			else if(vector_a[l]<-1.5574) vector_a[l] = -1.5574;
			vector_a[l] = atanf(vector_a[l]); //it's clipping
		}
		arm_biquad_cascade_df2T_f32(&S1, vector_a, vector_b, VECSIZE);
//		outvalue = vector_a[i];
		for(l = 0; l<VECSIZE; l++) //convert float vector to int vector
		{
		    vector_b[l] = vector_b[l]*(ADC3ConvertedVoltage[2]+0.7) + vector_a[l]*(1-ADC3ConvertedVoltage[2]);
		    vector_b[l] *= 0.25;
			if(vector_b[l]>1.5574) vector_b[l] = 1.5574;
			else if(vector_b[l]<-1.5574) vector_b[l] = -1.5574;
			vector_b[l] = atanf(vector_b[l]); //it's clipping
			vector_d[i%DELSIZE] = vector_b[l];
			DAC1ConvertedValue[l] = (uint16_t)(((vector_b[l])+1)*2047);
//			DAC2ConvertedValue[l] = (uint16_t)(((vector_b[l])+1)*2047);
		}
	//	outvalue = ((1-fb)*outvalue + (fb*fbvalue)) / 2;
//		for(k = 0; k<nfilters; k++)
//		{
//			float32_t tempout = outvalue;
//			outvalue = apply_filter(tempout, i, &(filters[k]));
//		}
//		fbvalue = outvalue;
//    	DAC1ConvertedValue = (uint16_t)(0.7*outvalue) + (uint16_t)(0.3*sig[(VECSIZE/9+i)%VECSIZE]);
//		outints = vector_a
//		outint = (uint16_t)((outvalue+1)*2047);
//		*DAC1ConvertedValue = *outints;
//		DAC1ConvertedValue = sig[i] = outint;
		i++;
//        i%=VECSIZE;
	}
	TIM6->SR = 0x0;
}

void init_GPIOA(void)
{
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
	//GPIOA init (outputs)
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_4 | GPIO_Pin_5;		  // we want to configure PA04
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AN; 	  // we want it to be analog
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;//this sets the GPIO modules clock speed
    GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;   // this sets the pin type to push / pull (as opposed to open drain)
    GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_Init(GPIOA, &GPIO_InitStruct);			  // this passes the configuration to the Init function which takes care of the low level stuff
}
/*
void init_GPIOB(void)
{
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
	//GPIOA init (outputs)
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;		  // we want to configure PA04
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AN; 	  // we want it to be analog
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;//this sets the GPIO modules clock speed
    GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;   // this sets the pin type to push / pull (as opposed to open drain)
    GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
    GPIO_Init(GPIOA, &GPIO_InitStruct);			  // this passes the configuration to the Init function which takes care of the low level stuff
}
*/
void init_GPIOC(void)
{
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
	//GPIOC init (inputs)
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3;
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AN;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz; //set GPIO clock speed to 100MHz
    GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL ;
    GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;   // this sets the pin type to push / pull (as opposed to open drain)
    GPIO_Init(GPIOC, &GPIO_InitStruct);
}
void init_GPIOD(void)
{
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
	//GPIOD init (indicators)
    GPIO_InitStruct.GPIO_Pin = GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15; // we want to configure all LED GPIO pins
    GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT; 		// we want the pins to be an output
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz; 	// this sets the GPIO modules clock speed
    GPIO_InitStruct.GPIO_OType = GPIO_OType_PP; 	// this sets the pin type to push / pull (as opposed to open drain)
    GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL; 	// this sets the pullup / pulldown resistors to be inactive
    GPIO_Init(GPIOD, &GPIO_InitStruct); 			// this finally passes all the values to the GPIO_Init function which takes care of setting the corresponding bits.
}

