3spds/stm32f4/Creosota_Tour_2015/src/main_filt_dsp.c
//	init_filter(&ap_1);
//	init_filter(&ap_2);
//	init_filter(&ap_3);
//	init_filter(&ap_4);
	for(k = 0; k<nfilters; k++)
	{
		//init_filter(&filters[k]);
	}

//	ap_filter_coefs(&ap_1);
//	ap_filter_coefs(&ap_2);
//	ap_filter_coefs(&ap_3);
//	ap_filter_coefs(&ap_4);
	for(k = 0; k<nfilters; k++)
	{
		//ap_filter_coefs(&filters[k]);
	}
	for(k = 0; k<VECSIZE; k++)
	{
		vector_a[k] = 0.0;
		vector_b[k] = 0.0;
	}

	noise.add = 3;
	noise.mod = gsize;
	noise.mul = 1;
	noise.out = 0;

	noise2.add = 3;
	noise2.mod = gsize;
	noise2.mul = 1;
	noise2.out = 0;

	noise3.add = 3;
	noise3.mod = gsize;
	noise3.mul = 1;
	noise3.out = 0;

	saw.add = 1.0/800;
	saw.mul = 1;
	saw.out = 0;
	saw.prev_add = 0;
	saw.slew = 0.994;

    melody.add = 1.0/10000;
	melody.mul = 1;
	melody.out = 0;
	melody.prev_add = 0;
	melody.slew = 0.9994;

    harmony.add = 1.0/10000;
	harmony.mul = 1;
	harmony.out = 0;
	harmony.prev_add = 0;
	harmony.slew = 0.9994;

    drone.add = 1.0/10000;
	drone.mul = 1;
	drone.out = 0;
	drone.prev_add = 0;
	drone.slew = 0.999994;

    dronelo.add = 1.0/10000;
	dronelo.mul = 1;
	dronelo.out = 0;
	dronelo.prev_add = 0;
	dronelo.slew = 0.99994;


	for(k = 0; k<(nfilters*5); k++) //repeat coefs nfilters times
	{
		coefTable[k] = coef_single[(k%5)];
	}
	arm_biquad_cascade_df2T_init_f32(
			&S1,
			nfilters,
			&coefTable,
			&biquadState);

    DAC_DeInit();
	init_GPIOA();
    init_GPIOC();
    init_GPIOD();
    init_DMA1();
    init_DMA2();
    init_TIM2();
    init_TIM3();
    init_TIM4();
    init_TIM6();
    init_ADC3();
	init_DAC();
    ADC_SoftwareStartConv(ADC3);
    while (1)
    {
		counter++;
    }
}
